eisup_2019_docmng_integration/src/InformationRegisters/РаботникиОрганизаций/РаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавокЗавершения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбособленноеПодразделениеЗавершения</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизацииЗавершения</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьЗавершения</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботыЗавершения</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостоянияЗавершения</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <attributes>
    <name>УдалитьТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.КадровоеПеремещениеОрганизаций</types>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
      <types>DocumentRef.УвольнениеИзОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьФизлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПриказ</name>
    <type>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ПричиныНетрудоспособности/ПричиныНетрудоспособности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныНетрудоспособности</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОбщееЗаболевание</name>
  </enumValues>
  <enumValues>
    <name>ПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ТравмаНаПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ТравмаВБыту</name>
  </enumValues>
  <enumValues>
    <name>ПособиеБезЗаболевания</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо3хЛет</name>
    <comment>Оплачивается по стажу весь б/л</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо7миЛетДляСостоящихВБраке</name>
    <comment>Оплачивается весь б/л, но через неделю - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо7миЛетДляНеСостоящихВБраке</name>
    <comment>Оплачивается весь б/л, но через 10 дней - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетДляСостоящихВБраке</name>
    <comment>Оплачивается две недели, вторая - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуДо15тиЛетДляНеСостоящихВБраке</name>
    <comment>Оплачивается две недели, с 11-го дня - 50%</comment>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ПоУходуЗаВзрослым</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Протезирование</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриДолечивании</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВыплатыПособийЗаСчетФедеральногоБюджета/ВыплатыПособийЗаСчетФедеральногоБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВыплатыПособийЗаСчетФедеральногоБюджета</name>
  <enumValues>
    <name>Семипалатинск</name>
  </enumValues>
  <enumValues>
    <name>Чернобыль</name>
  </enumValues>
  <enumValues>
    <name>Маяк</name>
  </enumValues>
  <enumValues>
    <name>ПодразделенияОсобогоРиска</name>
  </enumValues>
  <enumValues>
    <name>ЗачетНестраховыхПериодов</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыЛьготПриНачисленииБольничных/ВидыЛьготПриНачисленииБольничных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЛьготПриНачисленииБольничных</name>
  <enumValues>
    <name>Семипалатинск</name>
  </enumValues>
  <enumValues>
    <name>Чернобыль</name>
  </enumValues>
  <enumValues>
    <name>Маяк</name>
  </enumValues>
  <enumValues>
    <name>ПодразделенияОсобогоРиска</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыОграниченияПособия/ВидыОграниченияПособия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОграниченияПособия</name>
  <enumValues>
    <name>ОбщееОграничение</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеВРазмереММОТ</name>
  </enumValues>
  <enumValues>
    <name>БезОграничений</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/CommonModules/НачислениеПоБольничномуЛистуСервис/Module.bsl
Процедура ПрочитатьДанныеОЛьготах(Объект) Экспорт
	
	Сотрудник = Объект.Сотрудник;
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		
		Запрос = Новый Запрос;
		Если Объект.ПериодРегистрации < ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами() Или Объект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ТравмаНаПроизводстве Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Физлицо,
			|	ЗНАЧЕНИЕ(Перечисление.ВыплатыПособийЗаСчетФедеральногоБюджета.ПустаяСсылка) КАК ВыплатаЗаСчетФедеральногоБюджета
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка = &Ссылка";
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизаций.Физлицо,
			|	ВЫБОР
			|		КОГДА СотрудникиОрганизаций.Физлицо.ЛьготаПриНачисленииПособий = ЗНАЧЕНИЕ(Перечисление.ВидыЛьготПриНачисленииБольничных.Маяк)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВыплатыПособийЗаСчетФедеральногоБюджета.Маяк)
			|		КОГДА СотрудникиОрганизаций.Физлицо.ЛьготаПриНачисленииПособий = ЗНАЧЕНИЕ(Перечисление.ВидыЛьготПриНачисленииБольничных.ПодразделенияОсобогоРиска)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВыплатыПособийЗаСчетФедеральногоБюджета.ПодразделенияОсобогоРиска)
			|		КОГДА СотрудникиОрганизаций.Физлицо.ЛьготаПриНачисленииПособий = ЗНАЧЕНИЕ(Перечисление.ВидыЛьготПриНачисленииБольничных.Семипалатинск)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВыплатыПособийЗаСчетФедеральногоБюджета.Семипалатинск)
			|		КОГДА СотрудникиОрганизаций.Физлицо.ЛьготаПриНачисленииПособий = ЗНАЧЕНИЕ(Перечисление.ВидыЛьготПриНачисленииБольничных.Чернобыль)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВыплатыПособийЗаСчетФедеральногоБюджета.Чернобыль)
			|		КОГДА ФизическиеЛицаСтажи.НомерСтроки ЕСТЬ НЕ NULL 
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВыплатыПособийЗаСчетФедеральногоБюджета.ЗачетНестраховыхПериодов)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВыплатыПособийЗаСчетФедеральногоБюджета.ПустаяСсылка)
			|	КОНЕЦ КАК ВыплатаЗаСчетФедеральногоБюджета
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.Стажи КАК ФизическиеЛицаСтажи
			|		ПО СотрудникиОрганизаций.Физлицо = ФизическиеЛицаСтажи.Ссылка
			|			И (ФизическиеЛицаСтажи.ВидСтажа = ЗНАЧЕНИЕ(Справочник.ВидыСтажа.РасширенныйСтраховойСтажДляБЛ))
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка = &Ссылка";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", Сотрудник);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
		
	Иначе
		
		Объект.Физлицо = "";
		Объект.ВыплатаЗаСчетФедеральногоБюджета = "";
		
	КонецЕсли;
	
	Объект.ПрименятьЛьготыПриНачисленииПособия = ЗначениеЗаполнено(Объект.ВыплатаЗаСчетФедеральногоБюджета);

КонецПроцедуры

Процедура ПрочитатьРазмерыПособия(Объект, ДополнительныеДанные, ТолькоДополнительныеДанные, ГоловнаяОрганизация = Неопределено) Экспорт

	НачислениеПоБольничномуЛистуПереопределяемый.ОбновитьРазмерыПособия(Объект, ДополнительныеДанные, ТолькоДополнительныеДанные);
	
	Если ТолькоДополнительныеДанные Тогда
		Возврат
	КонецЕсли;
	
	Если ГоловнаяОрганизация = Неопределено Тогда
		ГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Объект.Организация)
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВыплатаЗаСчетФедеральногоБюджета) Тогда
		Объект.ПроцентОплатыБезЛьгот = Объект.ПроцентОплаты;
		Объект.ОграничениеПособияБезЛьгот = Объект.ОграничениеПособия;
		Если Объект.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ВыплатыПособийЗаСчетФедеральногоБюджета.ЗачетНестраховыхПериодов Тогда
			
			ДатаНачалаСобытия 	= Объект.ДатаНачалаСобытия;
			Сотрудник			= Объект.Сотрудник;
			Физлицо				= Объект.Физлицо;
			
			Если Объект.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ПоБеременностиИРодам Тогда	
				
				Объект.ПроцентОплаты = 100;
				
				ДатаСтажа = ПроведениеРасчетов.ПолучитьНачалоСтажаДляБольничногоЛиста(ДатаНачалаСобытия, Физлицо, ГоловнаяОрганизация, Справочники.ВидыСтажа.РасширенныйСтраховойСтажДляБЛ);
				Если ЗначениеЗаполнено(ДатаСтажа) Тогда
					Лет	= 0; Месяцев = 0; 
					ОбщегоНазначения.РазобратьРазностьДат(ДатаНачалаСобытия, ДатаСтажа, Лет, Месяцев);
					Если Лет * 12 + Месяцев >= 6 Тогда
						Объект.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение
					Иначе
						Объект.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ;
					КонецЕсли;
				Иначе
					Объект.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ;
				КонецЕсли;
				
			ИначеЕсли ДатаНачалаСобытия = '00010101' Тогда
				
				Объект.ПроцентОплаты = 100;
				
			Иначе
				
				Запрос = Новый Запрос;
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|	ВЫБОР
				|		КОГДА  РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
				|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|		ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
				|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
				|	КОНЕЦ КАК ПричинаИзмененияСостояния
				|ИЗ
				|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК РаботникиОрганизацийСрезПоследних
				|ГДЕ
				|	ВЫБОР
				|		КОГДА  РаботникиОрганизацийСрезПоследних.ПериодЗавершения <= &ДатаАктуальности
				|				И РаботникиОрганизацийСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
				|		ТОГДА РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостоянияЗавершения
				|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния
				|	КОНЕЦ <> &Увольнение";
				
				Запрос.Текст = ТекстЗапроса;
				Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаНачалаСобытия);
				Запрос.УстановитьПараметр("Сотрудник",			Сотрудник);
				Запрос.УстановитьПараметр("Увольнение",			Перечисления.ПричиныИзмененияСостояния.Увольнение);
				
				УжеНеРаботает = Запрос.Выполнить().Пустой(); // в рег-ре РаботникиОрганизаций нет других записей, кроме как об увольнении
				
				ДатаСтажа = ПроведениеРасчетов.ПолучитьНачалоСтажаДляБольничногоЛиста(ДатаНачалаСобытия, Физлицо, ГоловнаяОрганизация, Справочники.ВидыСтажа.РасширенныйСтраховойСтажДляБЛ);
				Если ЗначениеЗаполнено(ДатаСтажа) Тогда
					Лет	= 0; Месяцев = 0; 
					ОбщегоНазначения.РазобратьРазностьДат(ДатаНачалаСобытия, ДатаСтажа, Лет, Месяцев);
					Если Лет * 12 + Месяцев >= 6 Тогда
						Объект.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение
					Иначе
						Объект.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ;
					КонецЕсли;
					Объект.ПроцентОплаты = ?(УжеНеРаботает, 60,?(Лет >= 8, 100,?(Лет >= 5, 80, 60)));
					
				Иначе
					
					Объект.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОграничениеВРазмереММОТ;
					Объект.ПроцентОплаты = 60;
					
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			Объект.ПроцентОплаты = 100;
			Объект.ОграничениеПособия = Перечисления.ВидыОграниченияПособия.ОбщееОграничение;
		КонецЕсли;
	Иначе  
		Объект.ПроцентОплатыБезЛьгот = 0;
		Объект.ОграничениеПособияБезЛьгот = "";
	КонецЕсли;
	
КонецПроцедуры
